Revit 2016 API
Family.HasStructuralSection Method
 Identifies if this Family can have a structural section. This property is deprecated in Revit 2016. Use canHaveStructuralSection instead.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2015
Syntax
C#
[ObsoleteAttribute]
public bool HasStructuralSection()
Visual Basic
<ObsoleteAttribute> _
Public Function HasStructuralSection As Boolean
Visual C++
[ObsoleteAttribute]
public:
bool HasStructuralSection()
Return Value
 True if the Family can have structural section, false otherwise.
See Also
Family Class
Autodesk.Revit.DB Namespace